---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.IfcSiteGuid
source: html/d64636a8-8130-18e5-e11d-bde30f10e25a.htm
---
# Autodesk.Revit.DB.ParameterTypeId.IfcSiteGuid Property

"IfcSite GUID"

## Syntax (C#)
```csharp
public static ForgeTypeId IfcSiteGuid { get; }
```